from pprint import pprint
list_of_dicts = [
    {
        'Волгоград': 6,
        'Екатеринбург': 3,
        'Краснодар': 1,
        'Санкт-Петербург': 5,
        'Саратов': 2,
        'Тюмень': 6,
        'Уфа': 8
    },
    {
        'Волгоград': 1, 
        'Махачкала': 7, 
        'Новосибирск': 6, 
        'Самара': 7, 
        'Уфа': 5
    },
    {
        'Барнаул': 2,
        'Воронеж': 8,
        'Краснодар': 9,
        'Красноярск': 4,
        'Махачкала': 1,
        'Оренбург': 2,
        'Ростов-на-Дону': 1,
        'Самара': 1,
        'Тюмень': 2,
        'Хабаровск': 1
    },
    {
        'Владивосток': 3,
        'Воронеж': 4,
        'Ижевск': 9,
        'Иркутск': 6,
        'Казань': 2,
        'Краснодар': 5,
        'Нижний Новгород': 7,
        'Ульяновск': 1,
        'Челябинск': 7
    }
]


result_dict = {}
for elem in list_of_dicts:
	for i,j in elem.items():
		if i not in result_dict:
			result_dict[i] = set(str(j))
		else:
			result_dict[i].add(str(j))
		
		
pprint(result_dict)

# C:\Users\asu3\DS\Zabivalov\2024.04.20
 # 15:51:33 > python 7.py
# {'Барнаул': {'2'},
 # 'Владивосток': {'3'},
 # 'Волгоград': {'6', '1'},
 # 'Воронеж': {'8', '4'},
 # 'Екатеринбург': {'3'},
 # 'Ижевск': {'9'},
 # 'Иркутск': {'6'},
 # 'Казань': {'2'},
 # 'Краснодар': {'1', '5', '9'},
 # 'Красноярск': {'4'},
 # 'Махачкала': {'1', '7'},
 # 'Нижний Новгород': {'7'},
 # 'Новосибирск': {'6'},
 # 'Оренбург': {'2'},
 # 'Ростов-на-Дону': {'1'},
 # 'Самара': {'1', '7'},
 # 'Санкт-Петербург': {'5'},
 # 'Саратов': {'2'},
 # 'Тюмень': {'6', '2'},
 # 'Ульяновск': {'1'},
 # 'Уфа': {'5', '8'},
 # 'Хабаровск': {'1'},
 # 'Челябинск': {'7'}}

