def deck() -> tuple[int, str]:
	""" Функция генератор создает упорядоченную колоду карт """
	suits = ['черви', 'бубны', 'пики', 'трефы']
	for suit in suits:
		for i in range (2,15):
			yield i,suit
			
print(*list(deck())[::13])
print(*list(deck())[::5])
print(*list(deck()))


# C:\Users\asu3\DS\Zabivalov\2024.04.28
 # 11:31:56 > python 2.py
# (2, 'черви') (2, 'бубны') (2, 'пики') (2, 'трефы')
# (2, 'черви') (7, 'черви') (12, 'черви') (4, 'бубны') (9, 'бубны') (14, 'бубны') (6, 'пики') (11, 'пики') (3, 'трефы') (8, 'трефы') (13, 'трефы')
# (2, 'черви') (3, 'черви') (4, 'черви') (5, 'черви') (6, 'черви') (7, 'черви') (8, 'черви') (9, 'черви') (10, 'черви') (11, 'черви') (12, 'черви') (13, 'черви') (14, 'черви') (2, 'бубны') (3, 'бубны') (4, 'бубны') (5, 'бубны') (6, 'бубны') (7, 'бубны') (8, 'бубны') (9, 'бубны') (10, 'бубны') (11, 'бубны') (12, 'бубны') (13, 'бубны') (14, 'бубны') (2, 'пики') (3, 'пики') (4, 'пики') (5, 'пики') (6, 'пики') (7, 'пики') (8, 'пики') (9, 'пики') (10, 'пики') (11, 'пики') (12, 'пики') (13, 'пики') (14, 'пики') (2, 'трефы') (3, 'трефы') (4, 'трефы') (5, 'трефы') (6, 'трефы') (7, 'трефы') (8, 'трефы') (9, 'трефы') (10, 'трефы') (11, 'трефы') (12, 'трефы') (13, 'трефы') (14, 'трефы')