import numpy as np
import math

N = np.array([1661, 1842, 2125, 2430, 2202, 3006, 2102, 1702, 2333, 1969])
R = np.array([2695, 3053, 2754, 3430, 2871, 2983, 2836, 3082, 2881, 2969, 2886, 3202, 2943, 2961])
a = 0.05


print('\nЗабивалов Никита: Вариант №3', f'N: {N}, {type(N)}',f'R: {R}, {type(R)}',sep='\n', end='\n\n')


Mn = N.mean()
Dn = math.sqrt(sum(map(lambda x : (x-Mn) ** 2, N)) / (len(N)-1))
F_list_n = [(x-Mn) / Dn for x in N]
""" N """
# [np.float64(-1.2005170877463933), np.float64(-0.7442096688423672), np.float64(-0.030756632655409042), np.float64(0.7381591837298285), np.float64(0.16336309803856897), np.float64(2.1902756107393264), np.float64(-0.08874044831724663), np.float64(-1.097154633740509), np.float64(0.4936187437646874), np.float64(-0.42403816497048136)]
F_kvantil_n = [0.1151, 0.2296, 0.488, 0.7704, 0.5636, 0.98574, 0.4641, 0.1357, 0.6915, 0.3372]
uN = 0
uTest = 0
uR = 0
for a, b in enumerate(F_kvantil_n, start=1):
	uN += (b - (2*a - 1) / (2*len(N))) ** 2
uN = uN +(1/(12*10))


""" Проверка по тестовому решению """
test = [0.04006, 0.1711, 0.2514, 0.492, 0.5438, 0.591, 0.7422, 0.8133, 0.93574]
for a, b in enumerate(test, start=1):
	uTest += (b - (2*a-1)/(2*9)) ** 2
uTest = uTest + (1/(12*9))


Mr = R.mean()
Dr = math.sqrt(sum(map(lambda x : (x-Mr) ** 2, R)) / (len(R)-1))
F_list_r = [(x-Mr) / Dr for x in R]
""" R """
# np.float64(-1.4637765296888539), np.float64(0.4587727278584572), np.float64(-1.1469318196461404), np.float64(2.483356722538167), np.float64(-0.5186126488834718), np.float64(0.08285527526540755), np.float64(-0.7065713751799967), np.float64(0.6145099582184349), np.float64(-0.46491015565589333), np.float64(0.007671784746797629), np.float64(-0.4380589090421041), np.float64(1.2589398769493771), np.float64(-0.13195469764490653), np.float64(-0.035290209835265186)]
F_kvantil_r = [0.07215, 0.6772, 0.1251, 0.993431, 0.3015, 0.4681, 0.242, 0.7291, 0.3228, 0.5040, 0.33, 0.8962, 0.4483, 0.484]
for a, b in enumerate(F_kvantil_r, start=1):
	 x = (b - (2*a - 1) / (2*len(R))) ** 2
	 uR += x
uR = uR +(1/(12*14))


H0N = ' Выборка N соответствует нормальному закону распределения'
print(f'Гипотеза H0:{H0N}', f'{uN:.3} > {0.461} при уровне значимости а = {0.05}', 'Так как наблюдаемый статистический критерий сильно больше критического значения при любом уровне значимости, гипотезу H0 отвергаем ',sep='\n', end='\n\n')

H0R = ' Выборка R соответствует нормальному закону распределения'
print(f'Гипотеза H0:{H0R}', f'{uR:.3} > {0.461} при уровне значимости а = {0.05}','Так как наблюдаемый статистический критерий сильно больше критического значения при любом уровне значимости, гипотезу H0 отвергаем',sep='\n')

